trentgill/stm32-mw-usb-host/Core/Src/usbh_core.c
  phost->Control.state = CTRL_SETUP;
  phost->Control.pipe_size = USBH_MPS_DEFAULT;
  phost->Control.errorcount = 0U;

  phost->device.address = USBH_ADDRESS_DEFAULT;
  phost->device.speed = (uint8_t)USBH_SPEED_FULL;
  phost->device.RstCnt = 0U;
  phost->device.EnumCnt = 0U;

  /* Reset the device struct */
  USBH_memset(&phost->device.CfgDesc_Raw, 0, sizeof(phost->device.CfgDesc_Raw));
  USBH_memset(&phost->device.Data, 0, sizeof(phost->device.Data));
  USBH_memset(&phost->device.DevDesc, 0, sizeof(phost->device.DevDesc));
  USBH_memset(&phost->device.CfgDesc, 0, sizeof(phost->device.CfgDesc));

  return USBH_OK;
}


/**
  * @brief  USBH_RegisterClass
  *         Link class driver to Host Core.
  * @param  phost : Host Handle
  * @param  pclass: Class handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_RegisterClass(USBH_HandleTypeDef *phost, USBH_ClassTypeDef *pclass)
{
  USBH_StatusTypeDef status = USBH_OK;

  if (pclass != NULL)
  {
    if (phost->ClassNumber < USBH_MAX_NUM_SUPPORTED_CLASS)
    {
      /* link the class to the USB Host handle */
      phost->pClass[phost->ClassNumber++] = pclass;
      status = USBH_OK;
    }
    else
    {
      USBH_ErrLog("Max Class Number reached");
      status = USBH_FAIL;
    }
  }
  else
  {
    USBH_ErrLog("Invalid Class handle");
    status = USBH_FAIL;
  }

  return status;
}


/**
  * @brief  USBH_SelectInterface
  *         Select current interface.
  * @param  phost: Host Handle
  * @param  interface: Interface number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_SelectInterface(USBH_HandleTypeDef *phost, uint8_t interface)
{
  USBH_StatusTypeDef status = USBH_OK;

  if (interface < phost->device.CfgDesc.bNumInterfaces)
  {
    phost->device.current_interface = interface;
    USBH_UsrLog("Switching to Interface (#%d)", interface);
    USBH_UsrLog("Class    : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceClass);
    USBH_UsrLog("SubClass : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceSubClass);
    USBH_UsrLog("Protocol : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceProtocol);
  }
  else
  {
    USBH_ErrLog("Cannot Select This Interface.");
    status = USBH_FAIL;
  }

  return status;
}


/**
  * @brief  USBH_GetActiveClass
  *         Return Device Class.
  * @param  phost: Host Handle
  * @param  interface: Interface index
  * @retval Class Code
  */
uint8_t USBH_GetActiveClass(USBH_HandleTypeDef *phost){
  if(phost->pActiveClass != NULL){
    return phost->pActiveClass->ClassCode;
  }
  return 0xFF; // unknown class
}


/**
  * @brief  USBH_FindInterface
  *         Find the interface index for a specific class.
  * @param  phost: Host Handle
  * @param  Class: Class code
  * @param  SubClass: SubClass code
  * @param  Protocol: Protocol code
  * @retval interface index in the configuration structure
  * @note : (1)interface index 0xFF means interface index not found
  */
uint8_t USBH_FindInterface(USBH_HandleTypeDef *phost, uint8_t Class, uint8_t SubClass, uint8_t Protocol){
  USBH_InterfaceDescTypeDef *pif;
  USBH_CfgDescTypeDef *pcfg;

  pif = (USBH_InterfaceDescTypeDef *)NULL;
  pcfg = &phost->device.CfgDesc;

/*
// TESTING: print all interfaces
  uint8_t if_ix = 0U;
  while (if_ix < USBH_MAX_NUM_INTERFACES)
  {
    pif = &pcfg->Itf_Desc[if_ix];
    USBH_UsrLog("CSP[%i]: 0x%x 0x%x 0x%x.", if_ix, pif->bInterfaceClass, pif->bInterfaceSubClass, pif->bInterfaceProtocol);
    if_ix++;
  }
*/

  uint8_t if_ix = 0U;
  while (if_ix < USBH_MAX_NUM_INTERFACES){
    pif = &pcfg->Itf_Desc[if_ix];
    if (((pif->bInterfaceClass == Class) || (Class == 0xFFU)) &&
        ((pif->bInterfaceSubClass == SubClass) || (SubClass == 0xFFU)) &&
        ((pif->bInterfaceProtocol == Protocol) || (Protocol == 0xFFU))){
      // USBH_UsrLog("Selected CSP[%i].",if_ix);
      return  if_ix;
    }
    if_ix++;
  }
  return 0xFFU;
}


/**
  * @brief  USBH_FindInterfaceIndex
  *         Find the interface index for a specific class interface and alternate setting number.
  * @param  phost: Host Handle
  * @param  interface_number: interface number
  * @param  alt_settings    : alternate setting number
  * @retval interface index in the configuration structure
  * @note : (1)interface index 0xFF means interface index not found
  */
uint8_t USBH_FindInterfaceIndex(USBH_HandleTypeDef *phost, uint8_t interface_number, uint8_t alt_settings)
{
  USBH_InterfaceDescTypeDef *pif;
  USBH_CfgDescTypeDef *pcfg;
  uint8_t if_ix = 0U;

  pif = (USBH_InterfaceDescTypeDef *)NULL;
  pcfg = &phost->device.CfgDesc;

  while (if_ix < USBH_MAX_NUM_INTERFACES)
  {
    pif = &pcfg->Itf_Desc[if_ix];
    if ((pif->bInterfaceNumber == interface_number) && (pif->bAlternateSetting == alt_settings))
    {
      return  if_ix;
    }
    if_ix++;
  }
  return 0xFFU;
}


/**
  * @brief  USBH_Start
  *         Start the USB Host Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Start(USBH_HandleTypeDef *phost)
{
  /* Start the low level driver  */
  (void)USBH_LL_Start(phost);

  /* Activate VBUS on the port */
  (void)USBH_LL_DriverVBUS(phost, TRUE);

  return USBH_OK;
}


/**
  * @brief  USBH_Stop
  *         Stop the USB Host Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Stop(USBH_HandleTypeDef *phost)
{
  /* DeActivate VBUS on the port */
  (void)USBH_LL_DriverVBUS(phost, FALSE);

  /* Stop and cleanup the low level driver  */
  (void)USBH_LL_Stop(phost);

  /* Free Control Pipes */
  (void)USBH_FreePipe(phost, phost->Control.pipe_in);
  (void)USBH_FreePipe(phost, phost->Control.pipe_out);

  return USBH_OK;
}


/**
  * @brief  HCD_ReEnumerate
  *         Perform a new Enumeration phase.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_ReEnumerate(USBH_HandleTypeDef *phost)
{
  if (USBH_IsPortEnabled(phost) != 0U)
  {
    phost->device.is_ReEnumerated = 1U;

    /* Stop Host */
    (void)USBH_Stop(phost);
  }

#if (USBH_USE_OS == 1U)
  USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */

  return USBH_OK;
}


/**
  * @brief  USBH_Process
  *         Background process of the USB Core.
  * @param  phost: Host Handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_Process(USBH_HandleTypeDef *phost)
{
  __IO USBH_StatusTypeDef status = USBH_FAIL;

  /* check for Host pending port disconnect event */
  if ((phost->device.is_disconnected == 1U)
      || (phost->device.is_ReEnumerated == 1U)){
    phost->gState = HOST_DEV_DISCONNECTED;
  }

  switch(phost->gState){

    case HOST_IDLE :
      if((phost->device.is_connected) != 0U){
        switch(phost->async_state){

        case HOST_ASYNC_IDLE:
          USBH_UsrLog("USB Device Connected");
          phost->async_timer = HAL_GetTick() + 200; // delay 200ms
          phost->async_state = HOST_ASYNC_WAIT;
          break;

        case HOST_ASYNC_WAIT:
          /* Wait for 200 ms after connection */
          if(HAL_GetTick() >= phost->async_timer){
            // delay complete
            phost->async_timer = 0;
            phost->async_state = HOST_ASYNC_IDLE;

            phost->gState = HOST_DEV_WAIT_FOR_ATTACHMENT;
            (void)USBH_LL_ResetPort(phost);

            /* Make sure to start with Default address */
            phost->device.address = USBH_ADDRESS_DEFAULT;
            phost->Timeout = 0U;

#if (USBH_USE_OS == 1U)
            USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
          }
          break;
        }
      }
      break;

    case HOST_DEV_WAIT_FOR_ATTACHMENT: /* Wait for Port Enabled */
      if (phost->device.PortEnabled == 1U){
        USBH_UsrLog("USB Device Reset Completed");
        phost->device.RstCnt = 0U;
        phost->gState = HOST_DEV_ATTACHED;
#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      } else {
        switch(phost->async_state){

        case HOST_ASYNC_IDLE:
          if(phost->Timeout > USBH_DEV_RESET_TIMEOUT){
            phost->device.RstCnt++;
            if (phost->device.RstCnt > 3U){
              /* Buggy Device can't complete reset */
              USBH_UsrLog("USB Reset Failed, Please unplug the Device.");
              phost->gState = HOST_ABORT_STATE;
            } else {
              phost->gState = HOST_IDLE;
            }
#if (USBH_USE_OS == 1U)
            USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
          } else {
            phost->async_timer = HAL_GetTick() + 10; // delay 10ms
            phost->async_state = HOST_ASYNC_WAIT;
          }
          break;

        case HOST_ASYNC_WAIT:
          if(HAL_GetTick() >= phost->async_timer){
            // delay complete
            phost->async_timer = 0;
            phost->async_state = HOST_ASYNC_IDLE;
            // DO WORK
            phost->Timeout += 10U;
#if (USBH_USE_OS == 1U)
            USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
          }
          break;
        }
      }
      break;

    case HOST_DEV_ATTACHED :
      switch(phost->async_state){

      case HOST_ASYNC_IDLE:
        if (phost->pUser != NULL){
          phost->pUser(phost, HOST_USER_CONNECTION);
        }
        phost->async_timer = HAL_GetTick() + 100; // delay 100ms
        phost->async_state = HOST_ASYNC_WAIT;
        break;

      case HOST_ASYNC_WAIT:
        if(HAL_GetTick() >= phost->async_timer){
          // delay complete
          phost->async_timer = 0;
          phost->async_state = HOST_ASYNC_IDLE;

          // continue task
          phost->device.speed = (uint8_t)USBH_LL_GetSpeed(phost);

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
          phost->NakTimeout = USBH_NAK_SOF_COUNT;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */

          phost->gState = HOST_ENUMERATION;

